function setup() {
  createCanvas(600, 400);
  background(220);
  
  fill('#90CAF9'); // 배경 색깔
  rect(0, 0, 600, 400);
  
  fill('#388E3C'); // 잔디 색
  rect(0, 270, 600, 130);
  
  fill('#E3C39D'); // 농구 코트 색깔
  quad(50, 280, 10, 390, 590, 390, 550, 280);
  
  noFill();
  arc(60, 335, 300, 100, radians(258), radians(135)); // 왼쪽 진영 3점라인
  arc(540, 335, 300, 100, radians(45), radians(282)); // 오른쪽 진영 3점라인
  circle(300, 335, 50); // 코트 중앙 원
  line(300, 280, 300, 390); // 하프라인
  ellipse(170, 335, 65, 50); // 왼쪽 진영 자유투 원
  ellipse(430, 335, 65, 50); // 오른쪽 진영 자유투 원
  line(175, 311, 165, 360); // 왼쪽 진영 자유투 라인
  line(425, 311, 435, 360); // 오른쪽 진영 자유투 라인
  line(175, 310, 44, 300); // 왼쪽 진영 페인트 존 위쪽 직선
  line(165, 360, 20, 365); // 왼쪽 진영 페인트 존 아래 직선
  line(425, 310, 556, 300); // 오른쪽 진영 페인트 존 위쪽 직선
  line(435, 360, 580, 365); // 오른쪽 진영 페인트 존 아래 직선
  line(70, 305, 72, 300);
  line(113, 308, 115, 303);
  line(60, 367, 60, 361);
  line(110, 359, 110, 365);
  line(530, 305, 528, 300);
  line(487, 308, 485, 303);
  line(540, 367,540, 361);
  line(490, 359, 490, 365);
  
  stroke('#0D1B2A');
  strokeWeight(9);
  line(50, 330, 50, 200); // 왼쪽 골대 기둥
  line(550, 330, 550, 200); // 오른쪽 골대 기둥
  
  fill('#64B5F6 ');
  stroke(255);
  strokeWeight(4);
  quad(35, 165, 35, 229, 61, 171, 61, 111); // 왼쪽 골대 큰 박스
  quad(565, 165, 565, 229, 539, 171, 539, 111); // 오른쪽 골대 큰 박스
  
  noFill();
  strokeWeight(2);
  quad(44, 175, 44, 210, 52, 190, 52, 155); // 왼쪽 골대 작은 박스
  quad(556, 175, 556, 210, 548, 190, 548, 155); // 오른쪽 골대 작은 박스
  
  strokeWeight(1);
  stroke(255);
  // 왼쪽 골대 그물
  line(60, 190, 61, 220);
  line(75, 188, 74, 220);
  line(67, 189, 67, 220);
  line(52, 200, 58, 225);
  line(86, 200, 80, 225);
  line(69, 210, 69, 230);
  line(60, 205, 63, 228);
  line(77, 210, 75, 228);
  // 오른쪽 골대 그물
  line(540, 190, 539, 220);
  line(525, 188, 526, 220);
  line(533, 189, 533, 220);
  line(548, 200, 542, 225);
  line(514, 200, 520, 225);
  line(531, 210, 531, 230);
  line(540, 205, 537, 228);
  line(523, 210, 525, 228);
  
  strokeWeight(3);
  stroke('#FF6F00');
  ellipse(69, 198, 35, 25); // 왼쪽 골대
  ellipse(531, 198, 35, 25); // 오른쪽 골대
  
  fill('#F57C00');
  stroke(0);
  strokeWeight(1);
  circle(300, 210, 30); // 가운데 농구공
  line(300, 195, 300, 225);
  arc(285, 210, 20, 20, radians(295), radians(65));
  arc(315, 210, 20, 20, radians(115), radians(245));
  
  fill('#A3B18A');
  circle(150, 105, 30); // 왼쪽 농구공
  line(150, 90, 150, 120);
  arc(135, 105, 20, 20, radians(295), radians(65));
  arc(165, 105, 20, 20, radians(115), radians(245));
  
  fill('#E0E0E0');
  circle(450, 105, 30); // 오른쪽 농구공
  line(450, 90, 450, 120);
  arc(435, 105, 20, 20, radians(295), radians(65));
  arc(465, 105, 20, 20, radians(115), radians(245));
}